app/Controllers/Clientes.php

    public function index()
    {
        $clientes = $this->clientes->where('activo', 1)->findAll();
---
SELECT *
FROM `clientes`
WHERE `activo` = 1

    public function insertar()
    {
        $this->clientes->insert(
            [
                'nombre' => mb_strtoupper($this->request->getPost('nombre')),
                'email' => mb_strtolower($this->request->getPost('email')),
                'telefono' => $this->request->getPost('telefono')
            ]
        );
---
INSERT INTO `clientes` (`nombre`, `email`, `telefono`, `f_create`, `f_update`) VALUES ('CACACACA', 'dafsd@fasdfa.com', '4654646465', '2022-09-27 13:42:48', '2022-09-27 13:42:48')